apps/test-suite/load-test.yml
config:
  target: "https://staging-firecrawl-scraper-js.fly.dev/v0"
  http:
    timeout: 30
  phases:
    - duration: 60
      arrivalRate: 1 # Initial load
    - duration: 120
      arrivalRate: 2 # Increased load
    - duration: 180
      arrivalRate: 3 # Peak load
    - duration: 60
      arrivalRate: 1 # Cool down
  defaults:
    headers:
      Authorization: "Bearer YOUR_API_KEY"
scenarios:
  - name: Crawl a URL
    flow:
      - post:
          url: "/crawl"
          json:
            url: "https://rsseau.fr"
            crawlerOptions:
              limit: 100
            pageOptions:
          capture:
            - json: "$.jobId"
              as: job_id
      - think: 10
      - get:
          url: "/crawl/status/{{ job_id }}"
          capture:
            - json: "$.status"
              as: crawl_status
          until:
            - condition: "equals"
              value: "completed"
              variable: "crawl_status"
          retry:
            count: 20
            wait: 10